
import oracledb

# create table TEST_TBL ( aa varchar2(100) );


#####################################################################################################
# DB 접속
#####################################################################################################
con = oracledb.connect(user="hr", password="hr", dsn="localhost:1521/xe")
cursor = con.cursor()


#####################################################################################################
# Insert (Write to DB)
#####################################################################################################
# in_data = "Hello World~ 안녕 오라클-파이썬"
# cursor.execute("insert into TEST_TBL (aa) values (:1)", [in_data])
# con.commit()


#####################################################################################################
# Select (Read from DB)
#####################################################################################################
cursor.execute("select * from employees")
out_data = cursor.fetchall()

for row in out_data:
    print(row)


con.close()

